{
  "share_id": "52c20aa5",
  "agent_type": "performance-insights",
  "player": {
    "gameName": "랭가애비되는사람입니다",
    "tagLine": "5096",
    "region": "na1"
  },
  "created_at": "2025-11-10T08:47:58.070803+00:00",
  "report_content": "# League of Legends Weakness Diagnosis Report\n\n## 1. Weakness Overview (300 words)\n\nBased on the analysis of 132 ranked games across patch 14, several critical weaknesses have emerged that are significantly impacting your overall performance and preventing you from climbing effectively. Your overall 49.2% winrate indicates you're currently at your skill ceiling, with specific areas requiring immediate attention.\n\nThe most glaring issue is your **severe underperformance in carry roles**, particularly MIDDLE (28.6% winrate) and TOP (36.8% winrate). This represents a fundamental gap in your ability to translate individual advantages into game wins when playing solo lanes. With only 7 games in MIDDLE and 19 in TOP, you're also suffering from **insufficient practice volume** in these positions, creating a vicious cycle where lack of experience leads to poor performance, which discourages further practice.\n\nYour **JUNGLE position shows concerning trends** with a 37.5% winrate across 40 games—a substantial sample size that indicates systemic issues rather than variance. This is particularly problematic as jungle is a high-impact role that should theoretically offer more agency over game outcomes. The data suggests fundamental weaknesses in pathing, objective control, or gank timing.\n\nConversely, your **UTILITY performance is strong** (61.0% winrate, 59 games) and BOTTOM shows exceptional results (71.4% winrate, 7 games), though the latter's small sample size makes it less reliable. This disparity reveals that you excel in supportive, reactive roles but struggle with proactive, carry-oriented gameplay.\n\nThe **champion pool analysis** reveals extreme fragmentation—34 different champions across 132 games averages less than 4 games per champion. While you have perfect winrates on multiple champions, these are all single-game samples that provide no meaningful data. This scattered approach prevents mastery development and suggests a lack of strategic focus in your champion selection, potentially indicating autopilot champion selection or inability to identify your actual strengths.\n\n## 2. Champion Pool Weaknesses (400 words)\n\nYour champion pool presents a **critical structural problem**: extreme over-diversification without depth. Playing 34 different champions across 132 games means you're averaging 3.88 games per champion, which is far below the threshold needed for mastery. This \"tourist approach\" to champion selection is one of your most significant weaknesses.\n\n**Lack of True Main Champions**: While you show multiple 100% winrate champions (IDs: 131, 54, 90, 48, 223, 22, 36, 32, 35, 10), every single one has between 1-2 games played. These statistics are meaningless—they represent lucky wins, favorable matchups, or team carries rather than genuine proficiency. In competitive League of Legends, champion mastery typically requires 30-50+ games to develop muscle memory, matchup knowledge, and win condition understanding.\n\n**No Statistical Reliability**: The absence of any champion with a significant game count (20+ games) means you have no reliable \"comfort picks\" to fall back on during difficult games or when facing skilled opponents. This creates a compounding problem: when you encounter adversity, you have no champion expertise to leverage for outplays or comeback mechanics.\n\n**Position-Specific Champion Issues**: Your weak positions (JUNGLE, TOP, MIDDLE) particularly suffer from this fragmentation. Without dedicated champion mastery in these roles, you're simultaneously learning:\n- Champion mechanics and combos\n- Matchup-specific trading patterns\n- Role-specific macro responsibilities\n- Win conditions and power spikes\n\nThis cognitive overload guarantees suboptimal performance. Expert players separate these learning phases—they master champions in normals before taking them into ranked, or they deeply specialize in 2-3 champions per role.\n\n**Meta Chasing vs. Comfort**: Your diverse champion pool suggests you may be \"meta chasing\"—picking currently strong champions without considering personal synergy. This approach fails because:\n1. Meta strength assumes equal mechanical proficiency\n2. You're competing against players with 100+ games on their mains\n3. Champion strength matters less than player comfort below Master tier\n\n**Hidden Opportunity Cost**: Every game on a new champion is a game NOT spent improving on a potential main. If you had focused your 132 games on 3-4 champions, you'd likely have 40-50 games each, placing you in the \"competent\" range with those champions and significantly improving your winrate in weak positions.\n\n**Recommendation Priority**: This is your #1 addressable weakness because it affects every other aspect of your gameplay and can be immediately corrected through disciplined champion selection.\n\n## 3. Position Weaknesses (400 words)\n\nYour positional performance reveals a **fundamental gap between supportive and carry-oriented gameplay**, with devastating winrates in solo lanes and jungle that demand immediate analysis.\n\n**MIDDLE Lane Crisis (28.6% winrate, 7 games)**: This represents your weakest position by far. While the small sample size (7 games) means variance plays a role, a sub-30% winrate indicates fundamental misunderstandings of mid lane principles:\n\n- **Wave Management Failures**: Mid lane requires pristine wave control for roaming windows and jungle coordination. Your low winrate suggests you're either constantly shoved in (losing roam priority) or mindlessly pushing (becoming gankable).\n- **Roaming Timing**: Mid laners must balance farm with map impact. You're likely either over-roaming (losing CS and levels) or never roaming (providing no map pressure).\n- **Mage vs. Assassin Confusion**: Different mid champion classes require completely different playstyles. Your champion diversity here works against you—you haven't specialized in either archetype.\n\n**TOP Lane Struggles (36.8% winrate, 19 games)**: With nearly 20 games, this sample size is statistically significant and reveals consistent problems:\n\n- **Split Push vs. Teamfight Identity**: Top lane requires clear decision-making about when to split and when to group. Your low winrate suggests poor judgment—either splitting when your team needs you or grouping when you should apply side lane pressure.\n- **Teleport Usage**: Top lane TP plays are game-deciding. You're likely either using TP reactively (to return to lane) rather than proactively (for bot lane plays), or mistiming TP flanks in teamfights.\n- **Dueling Fundamentals**: Top lane is heavily skill-matchup dependent. Without champion mastery (see Section 2), you lack the muscle memory for trading stance, wave manipulation during trades, and all-in timing.\n\n**JUNGLE Systematic Failure (37.5% winrate, 40 games)**: This is your most concerning weakness because:\n\n1. **Large sample size** (40 games) confirms this isn't variance\n2. **High agency role** should theoretically allow skilled players to impact outcomes\n3. **Consistent failure** suggests multiple fundamental gaps\n\nSpecific jungle weaknesses likely include:\n\n- **Pathing Inefficiency**: You're probably following generic clear patterns without adapting to game state, enemy jungler position, or lane priorities.\n- **Gank Timing**: Low winrate suggests either over-ganking (falling behind in farm/levels) or under-ganking (providing no lane pressure). Effective junglers balance these dynamically.\n- **Objective Control**: Dragon and Herald fights likely show poor setup—failing to establish vision, secure lane priority, or time your arrival with power spikes.\n- **Counter-Jungling Blindness**: You may be playing \"PvE jungle,\" clearing camps without tracking the enemy jungler, leading to failed ganks, stolen camps, or death to invades.\n\n**Successful Positions Analysis**: Your UTILITY (61.0%, 59 games) and BOTTOM (71.4%, 7 games) success reveals your actual strengths:\n\n- **Reactive Excellence**: You perform well when responding to enemy actions rather than creating proactive plays\n- **Team-Oriented Mindset**: Support roles reward team coordination over individual mechanics\n- **Vision and Macro**: Your likely strength in warding and map awareness shines in support roles\n\nThis contrast reveals that your weaknesses aren't mechanical but **strategic and proactive decision-making**.\n\n## 4. Skill-Level Weaknesses (300 words)\n\nAnalyzing across the three core skill dimensions—laning, teamfighting, and macro—your performance data reveals specific competency gaps:\n\n**Laning Phase Weaknesses**:\nYour poor performance in solo lanes (TOP 36.8%, MIDDLE 28.6%) directly indicates laning phase deficiencies:\n\n- **Trading Stance Ignorance**: You likely don't understand when you're strong vs. weak in lane. This fundamental concept—positioning aggressively when the enemy is weak (missing abilities, low HP, bad wave position) and defensively when you're vulnerable—separates good from bad laners.\n- **CS Priority Confusion**: Your willingness to play 34 different champions suggests you don't understand champion-specific CS patterns. Some champions must sacrifice early CS for safe scaling; others must pressure aggressively. Without champion mastery, you're making these decisions randomly.\n- **All-In Recognition**: Low solo lane winrates often indicate dying to ganks or all-ins. You probably don't track enemy cooldowns or recognize lethal damage windows, leading to preventable deaths that snowball lanes.\n\n**Teamfighting Execution**:\nYour success on UTILITY (61.0%) vs. failure on carry roles suggests teamfight weaknesses:\n\n- **Target Selection**: Carry roles require aggressive target selection and damage maximization. You're likely playing too safely on carries (low damage output) or too aggressively (dying first in fights).\n- **Positioning Discrepancy**: Your support success shows you understand safe positioning, but you're not translating this to carries. Carry positioning requires balancing aggression with safety—you probably position like a support even on damage dealers.\n- **Cooldown Commitment**: Effective carries use abilities on cooldown for maximum DPS. You may be \"saving\" abilities for perfect moments that never come, reducing your damage contribution.\n\n**Macro-Level Decision Making**:\nYour jungle failure (37.5%, 40 games) particularly highlights macro weaknesses:\n\n- **Map Pressure Blindness**: Jungle requires constant map reading—identifying which lanes are gankable, which objectives are contestable, where the enemy jungler is. Your low winrate suggests you're not processing this information effectively.\n- **Objective Timing**: You're likely starting objectives at wrong times—when your team lacks priority, when enemies have vision, or when you're outnumbered. This leads to lost objectives or team wipes.\n- **Win Condition Confusion**: Different team compositions require different strategies (split push, teamfight, pick, siege). Your diverse champion pool suggests you're not identifying your team's win condition and playing toward it.\n\n**Cross-Skill Pattern**: Your weaknesses cluster around **proactive decision-making**—you excel when following established patterns (support rotations, ADC positioning) but fail when required to create advantages independently (jungle pathing, solo lane pressure, roaming).\n\n## 5. Improvement Recommendations (400 words)\n\nBased on the diagnostic analysis, here are your **priority-ranked action items** for immediate improvement:\n\n### **PRIORITY #1: Radical Champion Pool Reduction (CRITICAL)**\n\n**Action Plan**:\n- **Immediately select 1 champion per position** (maximum 3 total champions)\n- For your weakest positions (JUNGLE, TOP, MIDDLE), choose mechanically simple champions:\n  - **JUNGLE**: Amumu, Rammus, or Warwick (simple, forgiving, clear win conditions)\n  - **TOP**: Garen, Malphite, or Mordekaiser (straightforward, teamfight-oriented)\n  - **MIDDLE**: Annie, Malzahar, or Veigar (simple mechanics, clear power spikes)\n- **Commit to 30+ games on each selected champion** before evaluating performance\n- **Track progress**: Create a spreadsheet logging each game's learnings\n\n**Expected Impact**: This single change should improve your weak position winrates by 10-15% within 50 games as you develop muscle memory and matchup knowledge.\n\n**Timeline**: Immediate implementation; results visible within 2-3 weeks.\n\n### **PRIORITY #2: Jungle Fundamentals Bootcamp (HIGH)**\n\nGiven your 40-game sample size at 37.5% winrate, jungle requires systematic relearning:\n\n**Action Plan**:\n- **Watch 5 educational videos** on jungle pathing for your chosen champion (Virkayu, Phylaris channels)\n- **Implement one concept per 5 games**:\n  - Games 1-5: Perfect your clear (practice tool first—achieve optimal clear speed)\n  - Games 6-10: Track enemy jungler (mentally note their position every 30 seconds)\n  - Games 11-15: Gank only when lanes have CC or enemy is overextended\n  - Games 16-20: Prioritize objectives over kills (dragons > ganks when possible)\n- **Record and review** one game per session—identify one mistake to fix next game\n\n**Expected Impact**: Systematic learning should raise jungle winrate to 45-50% within 20 focused games.\n\n**Timeline**: 2-3 weeks of dedicated practice.\n\n### **PRIORITY #3: Position Role Specialization (MEDIUM-HIGH)**\n\n**Action Plan**:\n- **Primary Role**: UTILITY (your strength—61.0% winrate)\n- **Secondary Role**: JUNGLE (needs improvement but has 40-game investment)\n- **Dodge or trade away**: TOP and MIDDLE in champion select\n- **Rationale**: Focus beats fragmentation. Mastering 2 roles > being mediocre at 5\n\n**Expected Impact**: Concentration of practice will accelerate improvement rate by 2-3x.\n\n**Timeline**: Immediate queue selection change.\n\n### **PRIORITY #4: Laning Phase Structured Learning (MEDIUM)**\n\n**Action Plan**:\n- **Study one matchup deeply per week** for your chosen champions\n- **Use practice tool**: Spend 10 minutes before ranked practicing CS under pressure (add enemy bot)\n- **Implement \"trading stance\"**: Watch one Leaguecraft 101 video on trading stance, apply for 5 games\n- **Set CS goals**: Aim for 7 CS/min minimum (currently likely lower based on winrates)\n\n**Expected Impact**: Better laning → better mid-game → 5-8% winrate improvement in weak positions.\n\n**Timeline**: 3-4 weeks to develop habits.\n\n### **PRIORITY #5: VOD Review Protocol (MEDIUM)**\n\n**Action Plan**:\n- **Review one loss per week** (focus on losses in weak positions)\n- **Specific questions to answer**:\n  - When did I fall behind? (timestamp)\n  - What decision led to that? (specific action)\n  - What should I have done instead? (alternative)\n- **Create \"mistake library\"**: Document repeated errors for conscious correction\n\n**Expected Impact**: Conscious error identification prevents repeated mistakes, 3-5% winrate improvement over time.\n\n**Timeline**: Ongoing practice, results accumulate over 4-6 weeks.\n\n---\n\n## Conclusion\n\nYour 49.2% winrate masks severe position-specific weaknesses (MIDDLE 28.6%, TOP 36.8%, JUNGLE 37.5%) caused primarily by **champion pool fragmentation** and **proactive gameplay deficiencies**. The path forward is clear: drastically reduce your champion pool, systematically rebuild jungle fundamentals, specialize in 2 positions, and develop structured learning habits. These changes are entirely within your control and don't require mechanical improvement—only disciplined execution. Implementing Priority #1 alone should yield immediate results within 2 weeks. Your support performance (61.0%) proves you have the game knowledge to succeed; you simply need to channel it through focused practice rather than scattered experimentation.",
  "metadata": {
    "total_games": null,
    "time_range": "past-365",
    "model": "haiku"
  }
}