{
  "share_id": "6695ec2e",
  "agent_type": "performance-insights",
  "player": {
    "gameName": "랭가애비되는사람입니다",
    "tagLine": "5096",
    "region": "na1"
  },
  "created_at": "2025-11-10T08:50:05.396773+00:00",
  "report_content": "# League of Legends Weakness Diagnosis Report\n\n## 1. Weakness Overview (300 words)\n\nBased on the comprehensive analysis of 132 ranked games across patch 14, several critical weaknesses have emerged that are significantly impacting your overall performance and preventing you from climbing effectively. While your overall winrate stands at 49.2%, which appears balanced on the surface, a deeper examination reveals substantial positional inconsistencies that require immediate attention.\n\nThe most glaring weakness is your **severe underperformance in solo lanes**, particularly Middle (28.6% winrate) and Top (36.8% winrate). This represents a fundamental gap in your ability to operate independently without consistent support from teammates. The contrast between your 61% winrate on Utility and your catastrophic 28.6% winrate on Middle lane indicates a heavy reliance on supportive playstyles where mistakes are more forgivable and team coordination can compensate for individual weaknesses.\n\nYour **Jungle performance at 37.5% winrate** over 40 games—your second-most played role—is particularly concerning. This substantial sample size confirms this isn't variance but rather a systematic skill deficit in jungle pathing, objective control, and map pressure application. Given that Jungle is a high-impact role that can dictate game flow, this weakness significantly limits your ability to carry games.\n\nInterestingly, your champion pool shows extreme polarization: you achieve 100% winrate on 10 different champions, but these are all single-game or two-game samples, suggesting either favorable matchups, team carries, or insufficient data. The absence of any champion with both significant game volume and high winrate indicates a **lack of true champion mastery**—you haven't developed the deep expertise on any particular champion that allows for consistent performance regardless of team composition or game state.\n\nYour 71.4% winrate on Bottom lane (7 games) and 61% on Utility (59 games) demonstrates clear competency in duo-lane environments, suggesting your core mechanics and teamfighting aren't fundamentally flawed, but rather your **independent decision-making and solo-carry capabilities** require substantial development.\n\n## 2. Champion Pool Weaknesses (400 words)\n\nYour champion pool reveals a critical strategic flaw: **extreme diversification without specialization**. Playing 34 different champions across 132 games means you're averaging fewer than 4 games per champion, which is insufficient to develop the muscle memory, matchup knowledge, and situational mastery required for consistent success at any competitive level.\n\nThe pattern of multiple champions with 100% winrate but only 1-2 games played creates a dangerous illusion of competency. These isolated successes likely resulted from favorable circumstances—perhaps your team was already winning, the enemy lacked counterplay knowledge, or you faced significantly weaker opponents. This scattered approach prevents you from building the deep champion expertise that separates average players from those who can consistently carry.\n\n**Absence of Main Champions**: The most concerning aspect is the complete lack of any champion played 15+ games with a positive winrate. In your most-played role (Utility, 59 games), you should have 2-3 champions with 20+ games each, allowing you to develop true mastery. Instead, your champion diversity in this role likely spreads your practice too thin, preventing the development of advanced techniques like animation canceling, ability buffering, and precise damage calculation that come only through repetition.\n\n**Role-Specific Champion Issues**: \n\nFor Jungle (40 games at 37.5% winrate), your champion selection likely lacks coherence in playstyle. Successful junglers typically specialize in either early-game aggressive champions or scaling/farming junglers, developing expertise in one approach before expanding. Your poor winrate suggests you're randomly selecting champions without understanding their power spikes, optimal pathing patterns, or win conditions.\n\nFor Top lane (19 games at 36.8% winrate), the solo-lane nature means champion mastery is even more critical. Top lane matchups are highly knowledge-dependent—knowing precise trading patterns, wave management techniques, and power spike timings. Playing multiple different champions prevents you from internalizing these matchup-specific details.\n\n**Mechanical Consistency Issues**: Without champion mastery, you're likely making fundamental mechanical errors: missing ability combos, miscalculating damage output, failing to execute optimal trading patterns, and making poor itemization decisions. These errors compound in solo lanes where there's no support to cover mistakes.\n\n**Counter-pick Trap**: Your diverse champion pool suggests you may be counter-picking excessively, which is a common mistake. Counter-picking with unfamiliar champions typically results in worse outcomes than playing a mastered champion into a difficult matchup, because mechanical execution and game knowledge outweigh theoretical advantages.\n\n## 3. Position Weaknesses (400 words)\n\nYour positional performance reveals a fundamental skill gap in **autonomous gameplay and self-sufficiency**. The stark contrast between your 61% winrate on Utility and your 28.6% winrate on Middle, with Top at 36.8% and Jungle at 37.5%, demonstrates that you excel in supportive, reactive roles but struggle dramatically when required to generate advantages independently.\n\n**Middle Lane Crisis (28.6% winrate, 7 games)**:\n\nWhile the sample size is small, losing 5 out of 7 games in Middle lane indicates severe deficiencies in solo-laning fundamentals. Middle lane requires exceptional wave management, roaming timing, and trading mechanics. Your performance suggests you're likely losing lane priority consistently, allowing enemy midlaners to roam freely while you're stuck farming under tower or dying to ganks. The short lane distance in mid makes positioning errors immediately punishable, and your low winrate indicates poor spacing awareness and cooldown tracking.\n\n**Top Lane Struggles (36.8% winrate, 19 games)**:\n\nWith a more substantial 19-game sample, your Top lane weakness is confirmed as systematic. Top lane is the most isolated position, requiring superior 1v1 mechanics, wave manipulation mastery, and teleport usage. Your 36.8% winrate suggests multiple critical failures:\n\n- **Wave Management Deficiency**: Likely pushing at incorrect times, creating gank vulnerability\n- **Trading Pattern Ignorance**: Taking unfavorable trades, not respecting enemy power spikes\n- **Teleport Misuse**: Either using TP to return to lane (wasting map pressure) or failing to join crucial fights\n- **Split-push Judgment**: Poor decisions about when to group versus when to apply side-lane pressure\n\n**Jungle Underperformance (37.5% winrate, 40 games)**:\n\nYour second-most played role showing 37.5% winrate over 40 games represents your most impactful weakness. This substantial sample confirms systemic problems:\n\n- **Pathing Inefficiency**: Likely following rigid, predictable patterns that enemy junglers exploit\n- **Objective Control Failure**: Poor dragon/herald timing and setup, losing neutral objective contests\n- **Gank Execution Issues**: Either over-ganking (falling behind in farm) or under-ganking (providing insufficient pressure)\n- **Map Awareness Deficits**: Failing to track enemy jungler, leading to counterganks or stolen camps\n- **Vision Control Negligence**: Insufficient ward placement and denial, leaving your team blind\n\n**Successful Positions Analysis**:\n\nYour 61% winrate on Utility (59 games) and 71.4% on Bottom (7 games) reveals your comfort zone: duo-lane environments where you can react to situations rather than create them. In these roles, your ADC or team provides direction, allowing you to execute supportive actions—peeling, engaging when opportunities arise, and following up on teammate initiatives. This reactive playstyle works in duo lanes but fails catastrophically in solo positions requiring proactive advantage creation.\n\n## 4. Skill-Level Weaknesses (300 words)\n\n**Laning Phase Deficiencies**:\n\nYour solo-lane struggles indicate fundamental laning weaknesses. Successful laning requires mastery of multiple simultaneous concepts: last-hitting while harassing, tracking enemy cooldowns, managing wave positioning, and maintaining map awareness. Your low winrates in solo lanes suggest you're likely failing at several of these:\n\n- **CS Efficiency**: Probably averaging 5-6 CS/min in losing lanes rather than the 7-8 required to stay relevant\n- **Trading Stance Understanding**: Not recognizing when you hold positional advantage for free harass\n- **Power Spike Timing**: Fighting at wrong times (when enemy is stronger) or missing your own power windows\n- **Recall Timing**: Backing at suboptimal times, losing multiple waves and plate gold\n\n**Teamfighting Execution Problems**:\n\nWhile your Utility winrate suggests decent teamfighting, your Jungle and solo-lane failures indicate problems with teamfight initiation and target selection. As a support, you can follow your team's engage; as a jungler or solo laner, you must often create the engage or identify the correct target. Your struggles suggest:\n\n- **Target Priority Confusion**: Focusing tanks instead of accessible carries\n- **Positioning Errors**: Standing too forward (getting caught) or too far back (providing no threat)\n- **Ability Sequencing**: Using key abilities prematurely or holding them too long\n\n**Macro-Level Strategic Weaknesses**:\n\nYour poor Jungle performance particularly highlights macro deficiencies:\n\n- **Objective Prioritization**: Likely chasing kills instead of securing dragons, heralds, and towers\n- **Map Pressure Distribution**: Spending too much time in one area, neglecting other lanes\n- **Vision Strategy**: Insufficient deep warding and lack of systematic vision denial\n- **Win Condition Recognition**: Not identifying and playing toward your team's victory path\n- **Resource Allocation**: Poor judgment about which lanes deserve investment and which should be abandoned\n\nThese macro weaknesses explain why you succeed in structured duo-lane environments (where macro decisions are shared) but fail when independently responsible for map-wide decisions.\n\n## 5. Improvement Recommendations (400 words)\n\n**Priority 1: Immediate Role Specialization (Weeks 1-4)**\n\n**Action**: Commit exclusively to Utility role for your next 50 ranked games. This is your proven strength (61% winrate), and deepening expertise here will rebuild confidence while climbing. Simultaneously, completely abandon Middle, Top, and Jungle in ranked play.\n\n**Implementation**:\n- Dodge or accept autofill losses rather than playing weak roles\n- Select 2-3 Utility champions maximum (ideally one engage support, one enchanter, one mage support)\n- Play 20+ games on your highest winrate Utility champion to develop true mastery\n- Create a document tracking what you learned each game (successful roam timings, vision patterns, etc.)\n\n**Expected Outcome**: Winrate should climb to 55-58% within 30 games, improving your rank and mental state.\n\n---\n\n**Priority 2: Champion Pool Consolidation (Ongoing)**\n\n**Action**: Reduce your champion pool from 34 to 5 total champions (3 for main role, 2 for secondary).\n\n**Implementation**:\n- Identify your three most comfortable Utility champions based on past performance and enjoyment\n- Select one secondary role (recommend Bottom given your 71.4% winrate) with 2 champions\n- Create champion-specific cheat sheets: ability combos, power spikes, itemization paths, matchup tips\n- Watch 2-3 high-elo VODs per champion to learn advanced techniques\n- Practice 10 normal games per new champion before bringing to ranked\n\n**Expected Outcome**: Mechanical consistency improves dramatically; you'll execute combos instinctively rather than consciously, freeing mental resources for macro decisions.\n\n---\n\n**Priority 3: Structured Jungle Education (Weeks 5-12, if climbing with Priority 1)**\n\n**Action**: Since Jungle is your second-most played role, eventually fixing this weakness is valuable, but only after stabilizing your main role.\n\n**Implementation**:\n- Watch 5 full-game educational jungle VODs from high-elo players (Virkayu, Nathan Mott channels)\n- Learn one jungle champion deeply (15+ normal games) focusing on: optimal clear path, gank timing windows, objective setup\n- Practice tracking enemy jungler in normal games (place wards at their camps, predict their location)\n- Create a pre-game checklist: identify win condition, plan first 10 minutes, note objective timers\n\n**Expected Outcome**: After 30 focused games, Jungle winrate should improve to 45-48%.\n\n---\n\n**Priority 4: Laning Fundamentals Training (Ongoing, 15 min daily)**\n\n**Action**: Dedicate 15 minutes daily to Practice Tool focused on mechanics.\n\n**Implementation**:\n- Perfect CS training: Practice Tool, 10 minutes, aim for 95+ CS (every minion)\n- Combo execution: Practice each champion's full combo 20 times until muscle memory develops\n- Review replays of lost lanes: identify the exact moment you lost control, what you should have done differently\n\n**Expected Outcome**: CS/min improves by 1-1.5, providing 200-300 extra gold per game.\n\n---\n\n**Priority 5: Macro Decision-Making Framework (Weeks 8+)**\n\n**Action**: Develop systematic decision-making rather than reactive gameplay.\n\n**Implementation**:\n- Every death, ask: \"What information did I lack?\" (enemy position, cooldowns, vision)\n- Every recall, ask: \"What's the next objective?\" (dragon in 90s, top tower vulnerable, etc.)\n- Every teamfight, identify win condition before it starts: \"We win if we catch their ADC\" or \"We need to disengage if they engage first\"\n- Post-game, review 3 key decisions: one good, two improvable\n\n**Expected Outcome**: Systematic thinking replaces emotional reactions, improving decision quality by 20-30%.\n\n---\n\n**Conclusion**: Your path to improvement is clear: specialize in Utility role immediately, drastically reduce champion pool, and systematically address laning and macro fundamentals. The contrast between your 61% Utility winrate and 28-37% performance in other roles shows you have the foundational skills—you simply need focused practice in the right areas. Expect 2-3 months of dedicated implementation before seeing substantial rank improvement, but early confidence gains should appear within 2-3 weeks.",
  "metadata": {
    "total_games": null,
    "time_range": "past-365",
    "model": "haiku"
  }
}